<template>
    <div class="information">
        <button v-on:click="visible = !visible">
            <p>Информация </p>
            <img src="../../assets/img/NavInfo.svg" alt="Значёк информации">
        </button>
        <div class="information-list" v-show="visible">
            <div class="information-list-header">
                <h2>Информация</h2>
            </div>
            <div class="information-list-main">
                <h2>Базовая информация</h2>
                <p>Идея для сайта-игры возникла из сайта rgg.land и самого события. Ниже представлена базовая информация о RGG-LAND:</p>
                <p>RGG-LAND – это челлендж, в котором стримеры проходят рандомные игры на большой игровой карте. Целью является дойти до финиша, а на пути их сопровождает получение предметов.</p>
                <p>Участники обязаны стримить RGG-LAND на платформе Twitch. Рестримы разрешены.</p>
                <p>Все стримеры стартуют на игровой карте с клетки «СТАРТ» и должны дойти до финиша. Стримеры ходят независимо друг от друга. Стримеры перемещаются по игровой карте при помощи передвижения своей фишки. Стример, попавший на клетку «ФИНИШ», обязан пройти игру для победы в RGG-LAND. Если никто не прошел игру на клетке «ФИНИШ», то победителем в RGG-LAND будет считаться тот, кто по окончанию ивента, будет находиться на игровой карте ближе всего к финишу по сравнению с остальными участниками (учитывается количество клеток, которое осталось участнику для того, чтобы достигнуть финиша). Если по окончанию ивента на ближайшей к финишу клетке находится 2 и более стримера, то они оба (все) будут считаться победителями RGG-LAND.</p>
                <p>Из этого челленджа было взято, соревновательный интерес, передвижения по карте и предметы, которые могут как упростить, так и усложнить прохождение по карте.</p>
                <p>На сайте-игре, игроки также должны дойти до клетки «ФИНИШ» с клетки «СТАРТ», проходя игры, или выполняя задания (придуманные другими игроками) и используя предметы.</p>
                <p>Чуть изменены условия победы, для победы на этом сайте, надо первым дойти до клетки «Финал» и после этого, вас переправит на страницу с поздравлением победителя.</p>
                <h2>Движение по карте</h2>
                <ol>Ход состоит из следующих действий:
                    <li>Бросок кубика (кубиков) на передвижение по игровой карте и непосредственно осуществление самого передвижения с учетом всех модификаторов (подробнее в разделе правил «Предметы»);</li>
                    <li>Выбор игры, ее прохождение и выполнение заданий (подробнее в разделе «Роллы игр/заданий») или дроп (отказ от прохождения игры). Игроки выбирают игру и после прохождения игры, дропа, или выполнения задания, игроки получают предметы (подробнее в разделе правил «Получение предметов»), и могут использовать предметы (подробнее в разделе правил «Предметы).;</li>
                    <li>Действия после прохождения, дропа игры или выполнения задания. После прохождения игры или дропа игрок может использовать предметы. (Подробнее в разделах правил «Предметы»).</li>
                </ol>
                <p>Для того чтобы игроку осуществить свой ход и переместить фишку на игровой карте, необходимо бросить кубик d6. После броска игрок перемещается на количество клеток, соответствующее выпавшему числу. Если игрок бросает несколько кубиков d6, то его ход равен сумме выпавших на них значений.</p>
                <p>При попадании на новые клетки игроки выбирают игру. Для того чтобы сделать следующий ход, необходимо пройти или дропнуть игру. При выборе игры положение игрока не меняется.</p>
                <p>При прохождении игры, игрок передвигает свою фишку на игровой карте вперед, бросая кубик d6 (если нет модификаторов на кубик). Если у игрока на момент броска данного кубика положительный баланс очков (бонусные очки: n), то выпавший результат кубика прибавляется к очкам игрока и, соответственно, осуществляет передвижение на сумму положительных очков (бонусные очки: n + результат броска кубика). После осуществления хода положительные очки (бонусные очки: n) у игрока пропадают. Если у игрока отрицательный баланс очков (бонусные очки: - n), то результат броска кубика d6 (если нет модификаторов на кубик) прибавляется к отрицательным очкам (бонусные очки: - n + результат броска кубика). Если очки остаются отрицательными, игрок идет назад, но не дальше клетки «СТАРТ». После этого отрицательные очки пропадают.</p>
                <p>При дропе игры, игрок передвигает свою фишку на игровой карте НАЗАД, бросая кубик d6 (если нет модификаторов на кубик) и отнимает выпавшие очки из баланса очков. В ¬независимости от значения очков игрока, положительные, или отрицательные у него игрок идёт НАЗАД. Если очки положительные (бонусные очки: n), то игрок должен добавить к ним минус и нажать кнопку «Закончить ход». Если очки отрицательные, то игрок просто нажимает кнопку «Закончить ход». В любом из исходов, игрок перед нажатием кнопки «Закончить ход», получает предметы.</p>
                <p>Отрицательные очки (бонусные очки: - n) и положительные очков бонусные очки: n) не переносятся из хода в ход и исчезают после нажатия кнопки «Закончить ход».</p>
                <p>Очки к кубику/кубикам (на ход) учитываются после того, как игрок бросил кубик (кубики) на передвижение по игровой карте, но до того, как осуществил передвижение. Очки, получаемые путем использования предметов (подробнее в разделе правил «Предметы»), от других игроков, добавляются/убавляются игроком сразу же.</p>
                <p>Если игрок переместился с той или иной клетки, благодаря предметам, то его количество очков, текущая игра и задание, остаются прежними (подробнее в разделе правил «Получение предметов»). </p>
                <h2>Получение предметов</h2>
                <p>В процессе прохождения сайта-игры участники получают предметы (которые будут усложнять или упрощать для игроков его путь до финиша).</p>
                <p>Получение предметов происходит, при помочи кнопки «Получить предмет», игрок получает такое количество предметов, которое игроки обговорили в начале (рекомендуемое число получаемых предметов каждый ход: 3).</p>
                <p>В тексте некоторых предметов, может быть написано: «Колесо добра», там имеется в виду просто «Предмет».</p>
                <p>Игрок может получать предметы, только в свой ход.</p>
                <p>Все предметы, которые в момент выпадения обязывают играка, находящегося на клетке “ФИНИШ”, как-либо переместиться на игровой карте (например, “Телепорт”) подлежат рероллу (удалению и новому получению). </p>
                <p>Если предмет требует выбрать рандомного игрока/игроков, игроки определяют сами процесс рандомного выбора, например: игроки загадывают и называют числа в отрезке от 1 до числа игроков и через любой сайт, или приложение, получают случайное число/числа. </p>
                <p>Если в предмете написано слово «модификаторы», то под ними имеются в виду положительный модуль очков, предметы и эффекты, которые были (будут) использованы при осуществлении хода.</p>
                <h2>Роллы игр/заданий</h2>
                <p>Для прохождения по карте игрокам нужно проходить игры или выполнять задания. Если с играми все понятно, например, дойти до титров (подробнее в разделе «Случаи, при которых игра считается пройденной»), то с заданиями может быть не так ясно.</p>
                <p>Задания — это определенные цели, которые игроки сами придумывают для всей игры или для отдельного раунда. Игроки сами решают, будут ли задания, и если да, то какие (задания не обязательны). Задания распространяются на всех участников. </p>
                <p>Например, если игроки выбрали игру «Counter-Strike 2» и решили, что задания будут, кто-то может загадать следующее: «Убить двух противников в одном раунде, кто сможет — получит +2 очка», или «По итогам игры быть на первом месте, кто сможет — получит +5 очков». Это лишь пример возможных заданий. Задания могут быть разнообразными, и награда за их выполнение не обязательно должна быть в виде очков — это могут быть предметы, передвижение на определенное количество клеток и так далее. </p>
                <p>Про роллы заданий и игр, вы сами решаете, при каких случаях будет происходить реролл. Этот сайт, является подспорьем в соревновании между вами, с добавлением конечной цели и используемых предметов. </p>
                <p>Никто не запрещает вам, привязать реролл игры или задания, к кубику Айзека, только вот, его свойство: «Игрок рероллит одно из предложенного на выбор: текущую игру, предмет, или бросок кубика на передвижение по карте» изменится только для вас.</p>
                <p>Например, если вы придумали задание в игре «Counter-Strike 2» — «Поставить или обезвредить бомбу», и кому-то оно не понравилось, он может использовать «Кубик Айзека». Он сообщает об этом, и вы, или кто-то другой, можете предложить новое задание. </p>
                <h2>Случаи, при которых игра считается пройденной</h2>
                <ol>
                    <li>Получение финальных титров или финальной заставки, которые символизируют победу игрока. Получение игроком надписи «Game Over» не является случаем, при котором игра будет считаться пройденной. </li>
                </ol>
                <p>Это был лишь, пример, вы можете сами для себя решить все случаи, как заранее, так и во время игры. </p>
                <h2>Случаи, при которых осуществляется реролл игры</h2>
                <ol>
                    <li>Нельзя определить, что считать концом игры. </li>
                </ol>
                <p>Это был лишь, пример, вы можете сами для себя решить все случаи, как заранее, так и во время игры. Этот сайт, является подспорьем в соревновании между вами, с добавлением конечной цели и используемых предметов.</p>
                <h2>Что нельзя делать в процессе прохождения игры:</h2>
                <ol>
                    <li>Использовать чит-коды (если они есть в игре)</li>
                </ol>
                <p>Это был лишь, пример, вы можете сами для себя решить все случаи, как заранее, так и во время игры. Этот сайт, является подспорьем в соревновании между вами, с добавлением конечной цели и используемых предметов.</p>
                <h2>Что можно делать в процессе прохождения игры:</h2>
                <p>Вы сами решаете, что можно делать в процессе прохождения игры. Этот сайт, является подспорьем в соревновании между вами, с добавлением конечной цели и используемых предмета. </p>
                <h2>Предметы</h2>
                <p>Все предметы в инвентаре игрока одноразовые и уничтожаются при использовании, если не указано иное.</p>
                <p>Все предметы в инвентаре (кроме кубиков и Спецроллов) могут стакаться и работают отдельно друг от друга, если не указано иное.</p>
                <p>Все предметы в инвентаре игрока, которые используются автоматически или при каких-либо условиях, применяются в порядке очереди в которой они были получены.</p>
                <p>Все предметы в инвентаре игрока, которые имеют заряды (например, «Проклятые доспехи»), при переносе в инвентарь другого игрока, переносятся со всеми имеющимися на данный момент зарядами, если не указано иное. Многозарядные предметы (например, «Хет-трик») записываются в инвентарь игрока с припиской «[0/3]» и в дальнейшем пишется количество использованных зарядов: [1/3], [2/3]. При [3/3] предмет считается использованным и удаляется из инвентаря. Игрок должен менять цифру соответственно произошедшим событиям, которые связаны с изменением заряда. Многозарядный предмет уничтожается с использованием последнего заряда, если не указано иное.</p>
                <p>Если в предмете не написано «Предмет» или «Спецролл» - это не считается предметом, если не указано иное, и соответственно, используется в тот же момент, когда выпал предмет. При возможности срабатывания одновременно нескольких эффектов, которые игрок нароллил путем получения предметов, то они срабатывают поочередно, в том порядке, в котором они были получены.</p>
                <h2>Действующие эффекты:</h2>
                <p>Действующими эффектами в инвентаре являются пункты (НЕ предметы), которые действуют какое-либо время или будут активированы в определенный момент. Например: «Таксист», «Пассажир» и т.п.</p>
                <p>Если по каким-либо причинам инвентарь обнулился/удалился, то действующие эффекты тоже удаляются. При раздаче предметов из инвентаря или их сбросе, эффекты не учитываются.</p>
            </div>
            <div class="information-list-footer">
                <button @click="visible = !visible" class="close">Закрыть</button>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    name: 'Information',
    data() {
        return {
            visible: false,
        }
    }
}
</script>
<style scoped lang="scss">
.information {
    display: flex;
    align-items: center;
    justify-content: center;
    gap: 20px;
    z-index: 1;
    img {
        width: 30px;
        height: 30px;
    }

    button {
        background: none;
        border: none;
        cursor: pointer;
        outline: none;
        color: white;
        font-family: sans-serif;
        display: flex;
        align-items: center;
        gap: 20px;

        p {
            font-size: 20px;
        }
    }

    &-list {
        background: #2C2C2C;
        position: absolute;
        top: 10%;
        width: 1000px;
        overflow-y: scroll;
        scrollbar-color: red black;
        scrollbar-width: thin;
        height: 600px;
        border-radius: 20px;
        color: #E0E0E0;
        padding: 10px 20px;
        top: 50%;
        left: 50%;
        transform: translate(-50%, -50%);

        &-header {
            display: flex;
            align-items: center;
            flex-direction: column;
            gap: 10px;
        }

        &-main {
            display: flex;
            //align-items: center;
            flex-direction: column;
            gap: 20px;
            h2{

            }
            p{
                font-size: 16px;
            }
            ol{
                gap:20px;
                li{
                    margin-left: 20px;
                }
            }


        }

        &-footer {
            position: sticky;
            bottom: -10px;
            display: flex;
            justify-content: flex-end;
            height: 40px;
            background: #2C2C2C;

            .close {
                font-size: 18px;
                color: red;
                cursor: pointer;

                &:hover {
                    border-bottom: 1px solid red;
                }
            }
        }
    }
}
</style>